/**
 * Подробное объяснение опций: https://jestjs.io/docs/configuration
 */

const config = {
    // --------------------------------------------------------------------
    //                             ОБЩЕЕ
    // --------------------------------------------------------------------
    // Прерывать выполнение после первого упавшего теста (или после n, если число).
    bail: 1,
    // Очищать вызовы и результаты моков между тестами.
    clearMocks: true,
    // Детализированный отчёт о каждом тесте.
    verbose: true,
    // Корень проекта.
    rootDir: '.',
    // Где искать тесты.
    roots: ['<rootDir>/tests'],
    // Окружение выполнения тестов.
    testEnvironment: 'node',
    // Шаблоны поиска файлов с тестами (строго .mts).
    testMatch: ['<rootDir>/tests/**/*Test.mts'],
    // Исключать из поиска тестов.
    testPathIgnorePatterns: ['/node_modules/', '/dist/'],
    // --------------------------------------------------------------------

    // --------------------------------------------------------------------
    //                         TypeScript + ESM (.mts)
    // --------------------------------------------------------------------
    // Преднастройка для ESM-режима с ts-jest.
    preset: 'ts-jest/presets/default-esm',
    // Трансформация исходников TypeScript (строго .mts).
    transform: {
        '^.+\\.mts$': [
            'ts-jest',
            {
                useESM: true,
                tsconfig: '<rootDir>/tsconfig.json',
            },
        ],
    },
    // Какие расширения считать ESM-модулями (строго .mts).
    extensionsToTreatAsEsm: ['.mts'],
    // Резолвер, понимающий paths из tsconfig.
    resolver: 'ts-jest-resolver',
    // Сопоставления импортов с путями в проекте.
    moduleNameMapper: {
        '^@/(.*)\\.mjs$': '<rootDir>/src/$1.mts',
        '^@/(.*)$': '<rootDir>/src/$1',
        '^tests/(.*)\\.mjs$': '<rootDir>/tests/$1.mts',
        '^tests/(.*)$': '<rootDir>/tests/$1',
        '^(\\.{1,2}/.*)\\.mjs$': '$1',
    },
    // Расширения модулей, которые будет резолвить Jest.
    moduleFileExtensions: ['mts', 'mjs', 'js', 'json'],
    // --------------------------------------------------------------------
};

export default config;
